using UnityEngine;

// (*** 🚀 นี่คือ "แม่แบบ" ของ State ทั้งหมด 🚀 ***)
// (ไฟล์นี้ไม่ต้องเอาไปแปะใส่ GameObject ไหน)

public abstract class PlayerBaseState
{
    // (ฟังก์ชันนี้จะทำงาน "1 ครั้ง" ตอน "เข้า" State นี้)
    public abstract void Enter(PlayerManager player);

    // (ฟังก์ชันนี้จะทำงาน "ทุกเฟรม" ... ตราบใดที่ยัง "อยู่ใน" State นี้)
    public abstract void Tick(PlayerManager player);

    // (ฟังก์ชันนี้จะทำงาน "1 ครั้ง" ตอน "ออก" จาก State นี้)
    public abstract void Exit(PlayerManager player);
}